# Pandas

It is widely used for data analysis, data cleaning and most importantly it provides convertion to series and data frames.

- Series - one-dimensional array-like object;
- DataFrame - two-dimensional, zie-mutable, and potentially heterogenous tabular data structure with labeled axes;

In [1]:
import pandas as pd

In [2]:
# series
data = [1,2,3,4,5]

series = pd.Series(data)
print('series:\n', series)
print(type(series))

series:
 0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

In [4]:
# creating series from dict

data1 = {'a': 1,'b': 2, 'c':3}
series_dict = pd.Series(data1)
print(series_dict)
# here you can see it is providing dict names as the indexes, where in list it was different

a    1
b    2
c    3
dtype: int64

In [6]:
# also indexes can be set using additional information, can be added a date in time series example or so on

data = [10, 20, 30]
index = ['a','b','c']

pd.Series(data, index)

a    10
b    20
c    30
dtype: int64

In [23]:
# creating dataframes from a dictionary 

data = {
    'Name': ['Rolands', 'Kevin', 'Jan'],
    'Age': [32, 22, 21],
    'Gender': ['m','m','f']
}

df1 = pd.DataFrame(data)
print(df1)
print(type(df1))
# there we can see it returns it as class, thus can be investigated and edited in the code

      Name  Age Gender
0  Rolands   32      m
1    Kevin   22      m
2      Jan   21      f
<class 'pandas.core.frame.DataFrame'>

In [9]:
# creating dataframes from list of dictionaries

data = [
    {'Name': 'Rolands', 'Age': 32, 'Gender':'m'},
    {'Name': 'Kevin', 'Age': 33, 'Gender':'m'},
    {'Name': 'Jan', 'Age': 25, 'Gender':'f'},
]

df = pd.DataFrame(data)
print(df)
print(type(df))
# important to point out that these two outputs are really similar

      Name  Age Gender
0  Rolands   32      m
1    Kevin   33      m
2      Jan   25      f
<class 'pandas.core.frame.DataFrame'>

In [11]:
file_dir = 'datasets'
file_name = 'sales_data.csv'

import os

full_path = os.path.join(file_dir,file_name)

df = pd.read_csv(full_path)
df.head(5)

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal

In [12]:
df.tail(5)

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
235,10236,2024-08-23,Home Appliances,Nespresso Vertuo Next Coffee and Espresso Maker,1,159.99,159.99,Europe,PayPal
236,10237,2024-08-24,Clothing,Nike Air Force 1 Sneakers,3,90.00,270.00,Asia,Debit Card
237,10238,2024-08-25,Books,The Handmaid's Tale by Margaret Atwood,3,10.99,32.97,North America,Credit Card
238,10239,2024-08-26,Beauty Products,Sunday Riley Luna Sleeping Night Oil,1,55.00,55.00,Europe,PayPal
239,10240,2024-08-27,Sports,Yeti Rambler 20 oz Tumbler,2,29.99,59.98,Asia,Credit Card

In [14]:
# by knowing the index of needed row, you can find it using this loc, which locates the information about that index
df.loc[0]

Transaction ID              10001
Date                   2024-01-01
Product Category      Electronics
Product Name        iPhone 14 Pro
Units Sold                      2
Unit Price                 999.99
Total Revenue             1999.98
Region              North America
Payment Method        Credit Card
Name: 0, dtype: object

In [17]:
df.at[0, 'Product Name']

'iPhone 14 Pro'

In [21]:
df.iat[0, 3]

'iPhone 14 Pro'

In [30]:
# also using pandas dataframes you can add and drop columns easily

df1['Salary'] = [100, 200, 300]
print(df1)
# important now it doest duplicate if being rexecuted

      Name  Age Gender  Salary
0  Rolands   32      m     100
1    Kevin   22      m     200
2      Jan   21      f     300

In [31]:
df1.drop('Salary', axis=1, inplace=True)
print(df1)
# this can be executed to remove rows aswell using indexes (axis variable)

      Name  Age Gender
0  Rolands   32      m
1    Kevin   22      m
2      Jan   21      f

In [32]:
df.describe()

       Transaction ID  Units Sold   Unit Price  Total Revenue
count       240.00000  240.000000   240.000000     240.000000
mean      10120.50000    2.158333   236.395583     335.699375
std          69.42622    1.322454   429.446695     485.804469
min       10001.00000    1.000000     6.500000       6.500000
25%       10060.75000    1.000000    29.500000      62.965000
50%       10120.50000    2.000000    89.990000     179.970000
75%       10180.25000    3.000000   249.990000     399.225000
max       10240.00000   10.000000  3899.990000    3899.990000